<?php

namespace Database\Seeder\Base;

use App\Model\Team;
use Illuminate\Database\Seeder;

class TeamTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $this->createTeam(2, 1, 'A001', '專題組別-001', '企業e化', '網路匯流', '五專部', '資管五甲', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(3, 1, 'A002', '專題組別-002', '企業e化', '人機互動', '五專部', '資管五甲', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(4, 1, 'A003', '專題組別-003', '企業e化', '感知環境', '五專部', '資管五甲', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(5, 1, 'A004', '專題組別-004', '企業e化', '創新服務', '五專部', '資管五甲', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(6, 1, 'A005', '專題組別-005', '企業e化', '安全信賴', '五專部', '資管五甲', '成員、冗員、冗員、冗員、冗員');

        $this->createTeam(7, 2, 'B001', '專題組別-006', '數位內容與多媒體應用', '網路匯流', '大學部', '資管四A', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(8, 2, 'B002', '專題組別-007', '數位內容與多媒體應用', '人機互動', '大學部', '資管四A', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(9, 2, 'B003', '專題組別-008', '數位內容與多媒體應用', '感知環境', '大學部', '資管四A', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(10, 2, 'B004', '專題組別-009', '數位內容與多媒體應用', '創新服務', '大學部', '資管四A', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(11, 2, 'B005', '專題組別-010', '數位內容與多媒體應用', '安全信賴', '大學部', '資管四A', '成員、冗員、冗員、冗員、冗員');

        $this->createTeam(12, 3, 'B006', '專題組別-011', '數位內容與多媒體應用', '網路匯流', '大學部', '資管四A', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(13, 3, 'B007', '專題組別-012', '數位內容與多媒體應用', '人機互動', '大學部', '資管四A', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(14, 3, 'B008', '專題組別-013', '數位內容與多媒體應用', '感知環境', '大學部', '資管四A', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(15, 3, 'B009', '專題組別-014', '數位內容與多媒體應用', '創新服務', '大學部', '資管四A', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(16, 3, 'B010', '專題組別-015', '數位內容與多媒體應用', '安全信賴', '大學部', '資管四A', '成員、冗員、冗員、冗員、冗員');

        $this->createTeam(17, 4, 'C001', '專題組別-016', '網路應用與資通安全', '網路匯流', '研究所', '資管碩二', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(18, 4, 'C002', '專題組別-017', '網路應用與資通安全', '人機互動', '研究所', '資管碩二', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(19, 4, 'C003', '專題組別-018', '網路應用與資通安全', '感知環境', '研究所', '資管碩二', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(20, 4, 'C004', '專題組別-019', '網路應用與資通安全', '創新服務', '研究所', '資管碩二', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(21, 4, 'C005', '專題組別-020', '網路應用與資通安全', '安全信賴', '研究所', '資管碩二', '成員、冗員、冗員、冗員、冗員');

        $this->createTeam(22, 5, 'D004', '專題組別-021', '嵌入式系統與行動計算', '網路匯流', '進修部', '資管四1', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(23, 5, 'D004', '專題組別-022', '嵌入式系統與行動計算', '人機互動', '進修部', '資管四1', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(24, 5, 'D004', '專題組別-023', '嵌入式系統與行動計算', '感知環境', '進修部', '資管四1', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(25, 5, 'D004', '專題組別-024', '嵌入式系統與行動計算', '創新服務', '進修部', '資管四1', '成員、冗員、冗員、冗員、冗員');
        $this->createTeam(26, 5, 'D004', '專題組別-025', '嵌入式系統與行動計算', '安全信賴', '進修部', '資管四1', '成員、冗員、冗員、冗員、冗員');
    }

    public function createTeam($accountId, $teacherId, $team_number, $team_name, $team_field, $team_category, $education, $class, $member)
    {
        return Team::create([
            'accounts_id' => $accountId,
            'teachers_id' => $teacherId,
            'team_number' => $team_number,
            'team_name' => $team_name,
            'team_field' => $team_field,
            'team_category' => $team_category,
            'education' => $education,
            'class' => $class,
            'member' => $member,
        ]);
    }
}
